// import { Link } from "react-router-dom";
// import map from "@/assets/images/map.png";

// const ArticleData = () => {
//   return (
//     <div className="my-10">
//       <p className="text-3xl">جاهای دیدنی شیراز (حافظیه)</p>
//       <p className="my-4">
//         شب‌های شیراز شب‌های رویایی هستند که با احساسات گردشگران ارتباط عمیقی
//         برقرار می‌کنند. حافظیه از پربازدیدترین دیدنی‌های شیراز است. عاشقان حافظ
//         در همه جای ایران هستند؛ اما کسانی که اهل شعر و شاعری هستند می‌دانند که
//         شب‌های حافظیه حال و هوای دیگری دارد. محال است کسی اهل تاریخ و ادبیات
//         باشد، اما شب‌های حافظیه را در اولویت بازدید خود قرار ندهد.حافظیه شیراز
//         جذاب‌ترین مکان‌های دیدنی شیراز در شب برای گردشگرانی است که اهل شعر
//         باشند. این دسته از افراد شب را در آن سپری می‌کنند و با حافظ خوانی و تفأل
//         به حافظ، شبی خاطره‌انگیز را برای خود رقم می‌زنند. چه کسی می‌تواند یک شب
//         رویایی را در این مکان بگذراند و صبح با روحیه‌ای بسیار خوب قصد دیدن
//         مکان‌های دیگر را نکند!
//       </p>
//       <div className="flex justify-end ">
//         <Link
//           to=""
//           className="border-2 border-btnOrange rounded-lg flex items-center px-2 py-1 gap-2"
//         >
//           <img src={map} alt="" />
//           مشاهده در نقشه
//         </Link>
//       </div>
//     </div>
//   );
// };

// export default ArticleData;
